#+TITLE: Developing On Deck
#+AUTHOR: Devan Carpenter
#+EMAIL: devan@ii.coop
#+CREATOR: ii.coop
#+DATE: 17th of April, 2019
#+STARTUP: showeverything


** Final Touches

Then we want the spyglass url's to point to this local instance instead of the remote "prow.cncf.ci"
So we'll sed again... 

#+BEGIN_SRC shell
  sed -i sXhttp://prow.cncf.ciXhttp://ii.cncf.ci:8080Xg ~/src/test-infra/prow/cmd/deck/localdata/*js
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
#+END_EXAMPLE

Now we have a local Deck instance which can be develop on in quick iteration loops, while not having to
 worry about setting up, or maintaining, the rest of the Prow components; remote cluster. 


